In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL=postgresql://retail_user:Baua%401865@localhost:5432/retail_db

env: DATABASE_URL=postgresql://retail_user:Baua%401865@localhost:5432/retail_db

In [20]:
%%sql

-- ### Exercise 1 - Customer order count
-- Get order count per customer for the month of 2014 January.
-- * Tables - `orders` and `customers`
-- * Data should be sorted in descending order by count and ascending order by customer id.
-- * Output should contain `customer_id`, `customer_fname`, `customer_lname` and `customer_order_count`.


SELECT c.customer_id,c.customer_fname,c.customer_lname,count(*) AS customer_order_count 
FROM customers c LEFT OUTER JOIN orders o 
ON c.customer_id=o.order_customer_id AND to_char(o.order_date::date,'yyyy-MM')='2014-01' 
GROUP BY c.customer_id,c.customer_fname,c.customer_lname ORDER BY customer_order_count ASC LIMIT 10;

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(6114, 'Sandra', 'Nguyen', 1),
 (4790, 'Mildred', 'Smith', 1),
 (11233, 'Mary', 'Murphy', 1),
 (11719, 'Kelly', 'Shepherd', 1),
 (3936, 'Mary', 'Fernandez', 1),
 (5761, 'Mary', 'Smith', 1),
 (273, 'Benjamin', 'Smith', 1),
 (7662, 'Tiffany', 'Parsons', 1),
 (4326, 'Mary', 'Ferguson', 1),
 (2520, 'Gregory', 'Buck', 1)]